{
  "projects": [
    {
      "id": "1",
      "title": "WoodYou",
      "description": "Creation of a logotype for WoodYou, a specialist in made-to-measure wooden objects, based on the Tangram principle.",
      "tags": ["all", "graphic"],
      "imageNumber": 41,
      "section1": {
        "title": "Step 1:",
        "subtitle": " Defining the Message and Image",
        "description": "This is the logotype creation process for WoodYou, a company whose main activity is the creation of made-to-measure laser-cut wooden objects for toys, decoration and communication media. This is a two-stage process. The first wave of three proposals allows us to better define with the customer the message and image that the company needs to convey. After selecting a lead and refining the direction to be taken, the second wave of proposals is made. In this project, in the first wave, we were able to discard proposal no. 1 because it was more suggestive of luxury codes, which is not WoodYou's target. We also discarded proposal no. 2 because it only targeted the playful world of toys, where WoodYou wanted to reach beyond that."
      },
      "section2": {
        "title": "Step 2:",
        "subtitle": " Refine and select the Final Proposal",
        "description": "Proposal no. 3 was chosen as the basis for the rest of the project, because it evoked both playfulness, with its reference to the \"Tangram\" silhouette game, and tailor-made modularity, while at the same time benefiting from the appeal of a mascot animal. The bear was chosen to evoke nature and the forest in a more mature way than other small animals usually associated with childhood, and because it reflects the values of the company's founders: boldness, strength and determination. It was proposal no. 1 of the second wave that was chosen by the client, for its balance of elementary modular forms, retaining the Tangram reference."
      }
    },
    {
      "id": "2",
      "title": "My FrenChef",
      "description": "Chefs' recipes, family nutritional monitoring, video cooking lessons.",
      "tags": ["all", "graphic", "uxui"],
      "imageNumber": 18,
      "section1": {
        "title": "Enjoyable",
        "subtitle": " and Nutritious",
        "description": "MyFrenchef meets the need to closely monitor your diet while still enjoying your meals. It offers a wide selection of recipes presented by renowned chefs and allows you to track the nutritional intake of the whole family. By combining video cooking lessons, a recipe planner with a shopping list for ingredient purchases, and a nutrient dashboard, MyFrenchef simplifies daily meal management. Users can discover new recipes, learn sophisticated cooking techniques, and monitor their diet in a fun and enjoyable way."
      },
      "section2": {
        "title": "My Role:",
        "subtitle": " Artistic Direction, UX, and UI",
        "description": "On this project, my work encompasses both artistic direction and UX (user experience) and UI (user interface). As the artistic director, I ensure that MyFrenchef's visual identity is cohesive and appealing, reflecting the quality and expertise of the chefs. For UX, I design intuitive and pleasant user journeys, making it easier to navigate and use the app's various features. Regarding UI, I create clear and aesthetic interfaces, making the user experience not only functional but also visually pleasing. My goal is to ensure a smooth and enjoyable use of MyFrenchef, so users can focus on the joy of cooking and eating well."
      }
    },
    {
      "id": "3",
      "title": "Stane",
      "description": "Stane, creates modern health centers across France by linking public and private entities with healthcare practitioners.",
      "tags": ["all", "graphic", "uxui"],
      "imageNumber": 12,
      "section1": {
        "title": "Facilitator",
        "subtitle": " of Modern Health Centers",
        "description": "Stane, formerly known as Osanté, is a versatile group dedicated to creating health centers throughout France. Their mission is to forge connections between various local entities, whether public, private, or healthcare practitioners, to realize projects for modern and innovative health centers. Acting as a facilitator and catalyst, Stane contributes to improving access to healthcare by promoting infrastructures that meet the contemporary needs of both patients and healthcare professionals."
      },
      "section2": {
        "title": "My Role:",
        "subtitle": " Artistic Direction, UX, and UI",
        "description": "As part of this mission, I had the opportunity to play a crucial role as the head of artistic direction, user experience (UX), and user interface (UI). My involvement was essential to ensure that Stane's projects were not only functional but also aesthetically pleasing and intuitive for users. My work focused on designing a virtuel spaces that is both welcoming and efficient, meeting the expectations of practitioners and patients alike, to create environments conducive to high-quality care."
      }
    },
    {
      "id": "4",
      "title": "Tiny Office",
      "description": "Design and manufacture of stand-alone garden offices",
      "tags": ["all", "uxui"],
      "imageNumber": 8,
      "section1": {
        "title": "Innovating",
        "subtitle": " Home Office Solutions",
        "description": "TinyOffice is an innovative company specializing in designing and manufacturing autonomous office units to be installed in private gardens. These office units are designed to provide a private, practical, and aesthetic workspace, addressing the growing need for remote work and flexibility. By incorporating modern design solutions and advanced technologies, TinyOffice enables users to enjoy an optimal work environment directly at home while benefiting from the calming surroundings of their garden."
      },
      "section2": {
        "title": "My Role:",
        "subtitle": " UX and UI",
        "description": "In this project, I played a crucial role as the head of user experience (UX), user interface (UI), and the creation of a comprehensive visual identity, excluding the logo. My work involved designing an intuitive and user-friendly interface and developing a cohesive and attractive visual identity for TinyOffice units. The goal was to ensure a smooth and enjoyable user experience while enhancing the company's brand image and attracting quality and aesthetics-conscious clients."
      }
    },
    {
      "id": "5",
      "title": "Selaliqua",
      "description": "Selaliqua's e-commerce homepage redesign focuses on enhancing user engagement and conversion rates through a dialogue-driven approach that streamlines information and aligns with users' online reading behaviors.",
      "tags": ["all", "uxui"],
      "imageNumber": 3,
      "section1": {
        "title": "Through Dialogue:",
        "subtitle": " Selaliqua's Homepage Redesign",
        "description": "Selaliqua, an e-commerce client, sought to increase the conversion rate of their website traffic through a homepage redesign. The chosen approach was the \"dialogue\" method, treating the interface as an interlocutor that users engage with by asking questions. This method aimed to enhance the user dialogue by logically and smoothly organizing information. By simulating a natural conversation, the redesign ensures that users can easily find what they need, improving overall navigation and user satisfaction."
      },
      "section2": {
        "title": "Reducing Informational Noise",
        "subtitle": " and Enhancing User Flow",
        "description": "The dialogue approach effectively reduces informational noise that previously cluttered the homepage. This strategy considers the online reading habits of users, who typically scan pages in an \"F\" pattern, focusing on information placed at the top left, titles, and the initial words of paragraphs. By prioritizing key information in these areas, the redesigned homepage guides users efficiently, making important content more accessible and thereby improving the likelihood of conversions."
      }
    },
    {
      "id": "6",
      "title": "Odysium",
      "description": "Odysium is a company providing a medical concierge service and custom training programs for athletes. The project involved designing a PWA, it's flux and motion, from an existing graphic charter, to seamlessly integrate these two services.",
      "tags": ["all", "uxui"],
      "imageNumber": 5,
      "section1": {
        "title": "UX Process",
        "subtitle": " for a Comprehensive PWA",
        "description": "Building upon an existing graphic charter, the UX process for designing a Progressive Web App (PWA) for Odysium involved a meticulous and structured approach. The objective was to seamlessly combine the two primary services offered to Odysium's clients. The first service is a medical concierge tailored for athletes and their managers, providing them with personalized and accessible healthcare support. Understanding the unique needs and workflows of these users was crucial. Through user research, including interviews and surveys, we gathered insights into their daily routines, pain points, and preferences, which informed our design decisions."
      },
      "section2": {
        "title": "Integrating Training Programs",
        "subtitle": " for Enhanced User Experience",
        "description": "The second service focuses on customized training programs created by Odysium's coaches for the athletes they monitor. To integrate this into the PWA, we conducted a detailed analysis of how athletes interact with their training regimens. We employed user personas and journey mapping to visualize their experience and identify opportunities for improvement. Prototyping and user testing were essential to ensure that the interface was intuitive and engaging, allowing athletes to easily access and follow their training plans. By combining these two services into a cohesive PWA, we aimed to deliver a holistic and user-centered experience that enhances both the medical and training support for Odysium's clients."
      }
    },
    {
      "id": "7",
      "title": "Nuclear medicine centers",
      "description": "The project involved creating the graphic identity and designing a user-friendly website for the nuclear medicine centers in Île-de-France, focusing on appointment scheduling, detailed procedure explanations, and clear presentation of institutional information for a predominantly elderly audience.",
      "tags": ["all", "graphic", "uxui"],
      "imageNumber": 15,
      "section1": {
        "title": "Developing",
        "subtitle": " the Graphic Identity",
        "description": "The project began with creating the graphic identity for the nuclear medicine centers in Île-de-France. This involved designing a cohesive visual identity that would be instantly recognizable and convey professionalism and trust. The design elements, such as the logo, color palette, typography, and imagery, were chosen to reflect the seriousness and precision of the medical field. The aim was to ensure that patients and their families, as well as medical professionals, could easily identify and feel confident in the centers' branding."
      },
      "section2": {
        "title": "Designing the Website",
        "subtitle": " for Accessibility and Clarity",
        "description": "Following the graphic identity creation, the next step was to design a user-friendly website that addressed several key needs. The site was developed to facilitate appointment scheduling, providing detailed explanations of examination procedures, and presenting institutional information in a clear and organized manner. Given that the primary audience is predominantly elderly, the website's design focused on simplicity and readability, with intuitive navigation, larger text, and clear calls to action to ensure that users could easily access the information and services they needed."
      }
    },
    {
      "id": "8",
      "title": "You're Home",
      "description": "This project features citywide posters with the messages \"You arrived\" and \"You're home,\". The posters use the Pilowlava typeface by Anton Moglia and Jérémy Landes of the Velvetyne Foundry, celebrating their unique and expressive design.",
      "tags": ["all", "graphic"],
      "imageNumber": 4,
      "section1": {
        "title": "Art project",
        "subtitle": " citywide Poster Campaign",
        "description": "This project involves a series of posters strategically placed throughout a city, featuring the impactful messages \"You arrived\" and \"You're home\" with the background \"in silence, contemplate.\". The aim is to create a sense introspection for the city's inhabitants and visitors, encouraging them to take a moment to reflect on their surroundings and the journey they are on. These simple statements are designed to evoke feelings of arrival and belonging, making public spaces feel more welcoming and intimate, and for what they are."
      },
      "section2": {
        "title": "Design and Typography",
        "subtitle": " Celebrating Pilowlava",
        "description": "The graphic design of these posters is enhanced by the use of the Pilowlava typeface, created by Anton Moglia and Jérémy Landes of the Velvetyne Foundry. Pilowlava's unique and expressive style adds a layer of visual interest and sophistication to the project, making the messages stand out while also blending harmoniously with the urban environment. By crediting the creators and the foundry, the project not only showcases their innovative work but also highlights the importance of typography in conveying emotion and meaning in public art."
      }
    },
    {
      "id": "9",
      "title": "Belron ressources",
      "description": "I designed a mobile and desktop-compatible platform for Belron to help its branches coordinate and distribute communication materials, focusing on comprehensive content and user-friendliness for those less familiar with digital tools.",
      "tags": ["all", "graphic", "uxui"],
      "imageNumber": 4,
      "section1": {
        "title": "A Global",
        "subtitle": " Automotive Repair Group",
        "description": "Belron is a leading automotive repair group encompassing numerous brands such as Carglass, Autoglass, Safelite AutoGlass, and O'Brien, operating in 33 countries worldwide and employing over 25,000 people. The group required an online platform to help its branches coordinate the distribution of all their communication materials."
      },
      "section2": {
        "title": "User-Friendly",
        "subtitle": " Communication Platform",
        "description": "In response to Belron's needs, we designed a mobile and desktop-compatible platform that combines comprehensive content with ease of use. This simplicity was crucial, as the platform is intended for users who are not very familiar with digital tools. The platform ensures that all communication materials are easily accessible and manageable, enhancing coordination across Belron's extensive network."
      }
    },
    {
      "id": "10",
      "title": "L'atelier en boite",
      "description": "\"L'atelier en boîte\" was a temporary online art sale featuring curated boxes by ten renowned artists, offering an intimate glimpse into their studios and personal creations. The website art direction was inspired by the graphic principles of Josef Müller-Brockmann.",
      "tags": ["all", "graphic", "uxui"],
      "imageNumber": 4,
      "section1": {
        "title": "The Concept",
        "subtitle": " of \"L'atelier en boîte\"",
        "description": "\"L'atelier en boîte\" was a temporary art sale featuring works by renowned artists invited to showcase their studios through curated boxes. Artists such as Diane Benoit Du Rey, Katia Bourdarel, Thierry Carrier, Sylvain Ciavaldini, Gael Davrinche, Richard Di Rosa, Nicolas Marciano, Olivier Masmonteil, Françoise Petrovitch, and Lionel Sabatté presented original artworks and personal artifacts, offering a unique glimpse into their creative environments. The initiative aimed to provide an intimate connection between the public and the artists' work, particularly during the successive lockdowns of 2020."
      },
      "section2": {
        "title": "Graphic Aesthetic",
        "subtitle": " and Inspiration",
        "description": "The graphic aesthetic drew inspiration from the principles established by graphic designer Josef Müller-Brockmann, characterized by a minimalist approach with a focus on typography and structured layouts. This design choice aimed to evoke clarity and sophistication, echoing the meticulous presentation of the artists' studios within the curated boxes. The use of two distinct text styles emphasized readability and visual hierarchy, ensuring the artworks and their narratives were effectively communicated to the audience."
      }
    },
    {
      "id": "11",
      "title": "Mustela",
      "description": "Mustela, known for its baby and parental care products under Laboratoires Expanscience, launched a pregnancy tracking app in 2015. This app provides users with a comprehensive pregnancy overview, including medical appointment scheduling and product recommendations, earning it the \"Trophée des Apps\" from NPA Conseils for innovation in maternal health support.",
      "tags": ["all", "uxui"],
      "imageNumber": 3,
      "section1": {
        "title": "A Leader",
        "subtitle": " in Baby and Parental Care",
        "description": "Mustela is a brand specializing in baby and parental care products, owned by Laboratoires Expanscience. Their offerings cater to the needs of infants, expectant mothers, and young parents, providing essential skincare and hygiene solutions."
      },
      "section2": {
        "title": "Designing",
        "subtitle": " a Pregnancy Tracking App",
        "description": "To promote its maternity care products, we developed a pregnancy tracking application that provides users with a comprehensive overview of their pregnancy progress. This free app includes features such as medical appointment scheduling and essential pregnancy milestones, with Mustela products recommended within relevant tracking guidelines. In 2015, the application was honored with the \"Trophée des Apps\" by NPA Conseils for its innovation and effectiveness in maternal health support. Find more about the app on the Youtube channel of Mustela : https://www.youtube.com/watch?v=MATSQvRMUAY."
      }
    },
    {
      "id": "12",
      "title": "Alchemist Chocolate",
      "description": "I designed the visual identity for Swiss artisan chocolatier Alchemist Chocolate, focusing on packaging and store branding with an artistic direction inspired by chocolate alchemy, featuring elements of ancient book engravings and esoteric symbolism.",
      "tags": ["all", "uxui"],
      "imageNumber": 22,
      "section1": {
        "title": "Crafting the Visual Identity",
        "subtitle": " of Alchemist Chocolate",
        "description": "I undertook the design of the visual identity for Swiss artisan chocolatier, Alchemist Chocolate, including packaging and store branding. The artistic direction revolves around the concept of chocolate alchemy, drawing inspiration from ancient book engravings and esoteric symbolism."
      },
      "section2": {
        "title": "Aesthetic Influence",
        "subtitle": " and Design Approach",
        "description": "The aesthetic incorporates elements reminiscent of old book engravings and the mystique of esoteric symbols. This approach not only enhances the brand's allure but also aligns with the artisanal and transformative nature of chocolate-making at Alchemist Chocolate."
      }
    },
    {
      "id": "13",
      "title": "Stane's press kit",
      "description": "I designed Stane's press kit using InDesign, emphasizing their role in supporting healthcare professionals by managing auxiliary tasks. The collaborative process involved iterative feedback to ensure the final design effectively communicated Stane’s comprehensive services and commitment to allowing professionals to focus on their core medical duties.",
      "tags": ["all", "graphic"],
      "imageNumber": 15,
      "section1": {
        "title": "Press Kit Design",
        "subtitle": " for Stane",
        "description": "I designed and assembled the press kit for Stane using InDesign. Stane, a key partner for healthcare professionals, has supported the creation of over a hundred healthcare structures across France. As these structures became established, healthcare professionals sought continuous support for their daily operations. This led to the development of Stane’s management and coordination service, which includes an integrated management system based on the daily practices and needs of healthcare professionals. My goal was to highlight Stane's commitment to simplifying the workload for healthcare professionals, allowing them to focus on their core medical duties."
      },
      "section2": {
        "title": "Collaborative",
        "subtitle": " Design Process",
        "description": "The creation of the press kit involved a collaborative process with Stane, characterized by back-and-forth iterations to ensure complete satisfaction. The design emphasized Stane’s comprehensive services, such as procurement management, HR and administrative support, continuous training, digitalization of workflows, incident management, and team coordination. By managing these auxiliary aspects, Stane provides healthcare professionals with significant financial and time savings, which they can reinvest into their medical practice and personal well-being. The press kit visually and textually communicated Stane’s mission to enable professionals to concentrate on their core duties, enhancing both their professional efficiency and personal quality of life."
      }
    },
    {
      "id": "14",
      "title": "Haptic radar",
      "description": "Fo/Va is a haptic prosthesis designed for visually impaired individuals, using an Arduino, infrared sensor, Raspberry Pi, and vibrators to provide spatial awareness through tactile feedback. Beyond visual impairment, it has broader applications, such as enhancing safety for workers in hazardous environments by detecting obstacles through vibrations.",
      "tags": ["all", "uxui"],
      "imageNumber": 5,
      "section1": {
        "title": "Development of the Fo/Va",
        "subtitle": " Haptic Prosthesis",
        "description": "Fo/Va is a haptic prosthesis project designed for visually impaired individuals. In 2015, I developed a prototype using an Arduino, an infrared sensor, a Raspberry Pi, and vibrators. The sensor's data is analyzed and converted into vibrations felt by the user. For instance, an obstacle on the left activates the left-side vibrators under the clothing, while an obstacle on the right triggers the right-side vibrators. The proximity of the obstacle is indicated by the intensity of the vibrations, providing users with spatial awareness through tactile feedback."
      },
      "section2": {
        "title": "Broader Applications",
        "subtitle": " Beyond Visual Impairment",
        "description": "The application of the Fo/Va haptic prosthesis extends beyond aiding the visually impaired. It can be utilized in various fields, such as industry. For example, a worker on a hazardous construction site can use this device to augment their vision, sensing the presence of moving masses behind them. This additional sensory input can enhance safety and awareness, demonstrating the versatility and potential of haptic technology in diverse environments."
      }
    },
    {
      "id": "15",
      "title": "Paris Saint Germain",
      "description": "Enhancing the PSG store by designing interactive kiosks that provide visitors with real-time match results, club news, and upcoming schedules, creating a more engaging fan experience.",
      "tags": ["all", "uxui", "graphic"],
      "imageNumber": 8,
      "section1": {
        "title": "Enhancing",
        "subtitle": " the PSG Store Experience",
        "description": "The Paris-Saint-Germain soccer club's store sought to elevate its customer experience. To achieve this, we developed interactive kiosks within the retail space. These kiosks allow visitors to check the latest match results, stay updated with the club's social media news, and view the upcoming match schedule."
      },
      "section2": {
        "title": "Integrating Technology",
        "subtitle": " for Fan Engagement",
        "description": "The interactive kiosks were designed to provide a seamless and engaging experience for PSG fans. By offering real-time information and easy access to club updates, these kiosks help create a dynamic shopping environment that strengthens the connection between the club and its supporters."
      }
    },
    {
      "id": "16",
      "title": "Fovéa",
      "description": "Layout of my dissertation \"of the prosthesis in the light of interaction design\".",
      "tags": ["all", "uxui", "graphic"],
      "imageNumber": 5,
      "section1": {
        "title": "Exploring the Intersection",
        "subtitle": " of Design and Prosthetics",
        "description": "The thesis delves into the evolving role of design in the development of prosthetics, highlighting how innovative design approaches can enhance the functionality and aesthetics of prosthetic devices. It examines the history and progression of prosthetic design, emphasizing the shift from purely functional devices to those that also consider the user’s comfort, psychological well-being, and social acceptance. By integrating principles of industrial design, ergonomics, and user-centered design, the research underscores the potential of well-designed prosthetics to significantly improve the quality of life for individuals with limb loss."
      },
      "section2": {
        "title": "Technological Integration",
        "subtitle": " in Prosthetic Design",
        "description": "The thesis further explores contemporary case studies where advanced technology and creative design intersect in prosthetic development. It analyzes the use of materials like lightweight composites, the incorporation of sensors and microprocessors for enhanced movement, and the application of 3D printing for custom-fitted prosthetics. Additionally, the research discusses the collaborative processes between designers, engineers, and users, illustrating how interdisciplinary efforts lead to more effective and personalized prosthetic solutions. The thesis concludes with insights into future trends and the potential for further innovation in the field of prosthetic design."
      }
    },
    {
      "id": "17",
      "title": "Bone Hunt",
      "description": "Bone Hunt, a 2013 student project, transforms museum visits into an interactive scavenger hunt using QR codes and mini-games to educate visitors about anatomical specimens, encouraging repeated engagement through seasonal updates.",
      "tags": ["all", "uxui", "graphic"],
      "imageNumber": 11,
      "section1": {
        "title": "Concept and Design",
        "subtitle": " of Bone Hunt",
        "description": "Bone Hunt, a cherished student project from 2013, was created in response to a fictional call for proposals from the magnificent Musée d'Anatomie Comparée de Paris, my favorite Museum. This interactive exploration experience turns museum visits into an engaging scavenger hunt. Visitors search for small QR codes embedded in bone illustrations throughout the museum. Scanning these codes with an app triggers mini-games, which, when completed, unlock detailed information about the specimen near the discovered \"bone.\" This innovative approach aimed to make learning about anatomy fun and interactive."
      },
      "section2": {
        "title": "Enhancing Visitor Engagement",
        "subtitle": " Through Gamification",
        "description": "The experience is designed to retain visitor interest by allowing them to collect and preserve the unlocked information across multiple visits. Additionally, the hunts can be divided into seasons, offering new discoveries and maintaining the attraction for repeat visitors. This gamification of museum exploration not only enriches the educational experience but also encourages continuous engagement with the museum’s exhibits. The project's creative use of technology to blend education with entertainment exemplifies how interactive design can enhance visitor engagement in cultural institutions."
      }
    },
    {
      "id": "18",
      "title": "Monogram identity",
      "description": "This 2012 graphic identity project features a monogram design using the initials \"GP\", showcasing geometric precision and versatile application across various formats and media.",
      "tags": ["all", "graphic"],
      "imageNumber": 6,
      "section1": {
        "title": "Concept and Design",
        "subtitle": " Elements",
        "description": "The showcased graphic identity is a monogram design centered around the initials \"GP\" for Gilles Peltier. The design process starts with a foundational red triangle, symbolizing stability and direction. The monogram combines geometric precision with overlapping shapes, reflecting a modern and dynamic visual language. Key design elements include a consistent color palette with primary hues of red, dark blue, and beige, as well as the strategic use of negative space to create a seamless and versatile logo. These elements are aligned with the principles of geometric design, ensuring both aesthetic appeal and functional adaptability."
      },
      "section2": {
        "title": "Application",
        "subtitle": " and Versatility",
        "description": "The monogram is adapted into various formats, maintaining visual coherence across different backgrounds and applications. The color variations and pattern designs illustrate the monogram’s flexibility, showing its use in multiple contexts—from digital interfaces to printed materials. The repeated pattern of the monogram highlights its potential for creating visually engaging brand collateral. Additionally, the use of the monogram with the name \"Gilles Peltier\" in different color schemes demonstrates its effectiveness in reinforcing brand identity across diverse media."
      }
    },
    {
      "id": "19",
      "title": "Booki",
      "description": "My first contact with HTML and CSS. In this training project, I learned to create a responsive travel agency homepage using HTML and CSS, mastering the fundamentals of structured coding, layout design, and responsive principles. These skills are essential for advancing my career as a front-end developer, equipping me to deliver user-friendly web experiences across various devices and enhancing my adaptability in a dynamic digital landscape.",
      "tags": ["all", "frontend"],
      "imageNumber": 4,
      "repository": "https://github.com/Gilles-Lucien/booki-starter-code-master.git",
      "gitPages": "https://gilles-lucien.github.io/booki-starter-code-master/",
      "figma": "https://www.figma.com/design/B3eLowtWREc9YXzBcGRAHn/Maquettes-Booki",
      "section1": {
        "title": "What I Learned",
        "subtitle": ".",
        "description": "Creating a travel agency's homepage using HTML and CSS provided me with practical experience in web development fundamentals. I learned to structure the HTML content effectively, organizing sections such as headers, navigation bars, content areas, and footers to ensure clarity and accessibility in the codebase. This process not only improved my understanding of semantic HTML but also reinforced the importance of structured coding practices for maintainability and scalability in larger projects.\n\nCSS played a critical role in styling the webpage to mirror the design mockups accurately. Implementing layout techniques like flexbox and grid allowed me to create responsive designs that adapt seamlessly across different screen sizes—from mobile phones to large desktop monitors. Learning to use media queries enabled me to optimize the layout and styling based on device-specific characteristics, enhancing user experience by ensuring readability and usability across all devices.\n\nMoreover, integrating custom interface components using HTML and CSS was instrumental in achieving design fidelity. From creating responsive navigation menus to implementing image carousels and interactive elements, I honed my skills in translating static design concepts into dynamic and functional web interfaces. This hands-on experience not only improved my proficiency in front-end development but also deepened my appreciation for the intricate balance between design aesthetics and technical implementation."
      },
      "section2": {
        "title": "Application",
        "subtitle": " and Career Relevance",
        "description": "Mastering HTML and CSS integration for responsive web design is pivotal for advancing my career as a front-end developer. These foundational skills are essential for collaborating effectively with design teams and translating creative concepts into interactive web experiences that engage users across different devices.\n\nResponsive design principles, learned through this project, are critical in today's digital landscape where users access websites from diverse platforms. By ensuring that web pages render correctly on mobile, tablet, and desktop screens, I enhance usability and accessibility, thereby improving user satisfaction and retention. This capability not only demonstrates my technical proficiency but also underscores my commitment to delivering high-quality, user-centric solutions in web development projects.\n\nFurthermore, the ability to innovate with CSS frameworks and techniques underscores my adaptability and readiness to embrace new trends in web design. This agility is crucial for staying competitive in the fast-paced industry, where technological advancements continually redefine best practices and user expectations.\n\nIn conclusion, the skills acquired—HTML and CSS proficiency, responsive design expertise, and a meticulous approach to web development—are foundational for my career growth as a front-end developer. They empower me to create compelling, user-friendly web experiences that meet the demands of modern digital environments, positioning me for success in diverse roles within the web development ecosystem."
      }
    },
    {
      "id": "20",
      "title": "Oh my food",
      "description": "In this project, I learned to create a mobile-first startup website interface using Sass, CSS animations, and Git/GitHub, gaining essential skills for responsive design and effective project management.",
      "tags": ["all", "frontend"],
      "imageNumber": 5,
      "repository": "https://github.com/Gilles-Lucien/Ohmyfood_code.git",
      "gitPages": "https://gilles-lucien.github.io/Ohmyfood_code/",
      "figma": "https://www.figma.com/design/t4449fzDnwGYmzuwQdu87V/Maquettes-Ohmyfood-(mobile-et-desktop)",
      "section1": {
        "title": "Concept",
        "subtitle": " and Learning Objectives",
        "description": "In this training project, I worked on creating a mobile-first interface for a startup’s website. The project required the use of Sass for CSS preprocessing, the implementation of CSS animations, and version control with Git and GitHub. My primary task was to integrate a mobile-first design using provided mockups for both mobile and desktop, as well as prototypes on Figma, along with necessary images and text.\n\nThis mobile-first approach emphasized the importance of designing adaptive and responsive websites. Through this, I learned to implement CSS animations, which enrich the user experience by making the interface more interactive and engaging. Using Sass allowed me to extend the basic functionalities of CSS, helping me to write more organized and maintainable styles. Additionally, versioning the project with Git and GitHub familiarized me with essential tools for project management and collaboration in web development."
      },
      "section2": {
        "title": "Application",
        "subtitle": " and Career Relevance",
        "description": "The ability to create mobile-first web interfaces is increasingly in demand in modern web development. The skills I gained in integrating CSS animations not only enhance the visual appeal of websites but also improve user experience. Mastery of Sass for structuring and optimizing CSS is a valuable skill, as is the proficiency in using Git and GitHub for version control and project collaboration.\n\nThese combined skills strengthen my profile as a competent and versatile front-end developer. They enable me to deliver high-quality, user-centric web experiences that meet the expectations of today’s digital landscape, positioning me for success in various roles within the web development field. This project has equipped me with the practical knowledge and technical expertise needed to excel in my career and contribute effectively to any development team."
      }
    },
    {
      "id": "21",
      "title": "Print it",
      "description": "In this project, I learned JavaScript fundamentals by adding an interactive carousel to a static website, gaining essential skills for creating dynamic and engaging web experiences and enhancing my proficiency in modern web development.",
      "tags": ["all", "frontend"],
      "imageNumber": 4,
      "repository": "https://github.com/Gilles-Lucien/Print-it-JS.git",
      "gitPages": "https://gilles-lucien.github.io/Print-it-JS/",
      "section1": {
        "title": "Concept",
        "subtitle": " and Learning Objectives",
        "description": "In this training project, I learned the fundamentals of JavaScript by adding an interactive carousel to a static printing company's website. The project began with an exploration of JavaScript basics, a crucial programming language for developing interactive web features. I enhanced the website’s dynamism and user engagement by integrating the carousel functionality.\n\nMy main task was to update the existing HTML code and incorporate the JavaScript carousel, helping me understand how JavaScript interacts with HTML and CSS to create interactive web elements. I used Visual Studio Code to write and manage the code and GitHub for version control and storage. This hands-on experience provided valuable insights into programming with JavaScript in a real development environment."
      },
      "section2": {
        "title": "Application",
        "subtitle": " and Career Relevance",
        "description": "Proficiency in JavaScript is essential for any web developer. This language is ubiquitous in modern web development, and mastering it is crucial for creating interactive and responsive websites. The ability to combine JavaScript with HTML and CSS enables the development of more dynamic and engaging websites, a highly valued skill in the industry.\n\nThrough this project, I acquired the ability to make static websites interactive, significantly enhancing user experience. These skills strengthen my profile as a front-end developer, equipping me with the technical expertise to build more engaging and user-friendly web applications, thereby advancing my career in web development."
      }
    },
    {
      "id": "22",
      "title": "Architect's portfolio",
      "description": "In this project, I developed a dynamic web page for an interior designer’s website using JavaScript and API communication. I enhanced my front-end development skills by handling user events, manipulating the DOM, and creating interactive features, preparing me for advanced web development projects.",
      "tags": ["all", "frontend"],
      "imageNumber": 3,
      "repository": "https://github.com/Gilles-Lucien/Portfolio-architecte-sophie-bluel.git",
      "figma": "https://www.figma.com/design/kfKHknHySoTibZfdolGAX6/Sophie-Bluel---Desktop",
      "section1": {
        "title": "Concept",
        "subtitle": " and Learning Objectives",
        "description": "In this training project, I learned to create a dynamic web page for an interior designer’s website using JavaScript and API communication. My work focused on the front-end development, where I developed the architect’s portfolio page from provided HTML, handling user events and manipulating DOM elements with JavaScript.\n\nAdditionally, I created an admin login page and a modal for uploading new media, all developed from scratch, allowing me to deeply apply my JavaScript skills. For the first time, I accessed back-end code to test functionalities, learning to communicate with an API, which is crucial for modern web applications. Throughout the project, I used Figma for accessing mockups, Visual Studio Code for development, and GitHub for version control."
      },
      "section2": {
        "title": "Application",
        "subtitle": " and Career Relevance",
        "description": "The ability to create dynamic web pages with JavaScript is essential in web development. Learning to manage user interactions and communicate with APIs enables the creation of interactive and functional websites. Mastering these skills prepares me for more advanced web development projects and makes me a well-rounded and sought-after front-end developer.\n\nThis project equipped me with the technical expertise to build engaging and user-friendly web applications. By integrating JavaScript and API communication, I enhanced my ability to develop interactive web experiences, positioning myself for success in the evolving field of web development."
      }
    },
    {
      "id": "23",
      "title": "Kasa",
      "description": "In this project, I developed the front-end of an application using React and React Router, mastering data presentation, navigation management, and CSS enhancements.",
      "tags": ["all", "frontend"],
      "imageNumber": 6,
      "repository": "https://github.com/Gilles-Lucien/kasa.git",
      "figma": "https://www.figma.com/design/2BZEoBhyxt5IwZgRn0wGsL/Kasa_FR",
      "section1": {
        "title": "Concept",
        "subtitle": " and Learning Objectives",
        "description": "In this training project, I implemented the front-end of an application using React and React Router, aiming to create a modern and responsive user experience. I focused on the data presentation logic and React components, leveraging this popular JavaScript library to build user interfaces. I utilized React Router to set up navigation between different pages of the application, gaining a deep understanding of effective routing management in modern web applications. The project exclusively concentrated on front-end development, based on provided mockups and simulated data extracted from a JSON file. I began the project with Create React App, which simplifies the initial setup of a React application, and used Node.js to run JavaScript code outside the browser."
      },
      "section2": {
        "title": "Application",
        "subtitle": " and Career Relevance",
        "description": "Mastering React and React Router is crucial in modern web development, especially for creating dynamic and responsive web applications. Utilizing Sass to manage CSS and implementing CSS animations are also key skills that enhance the user experience. These skills enable me to develop interactive and visually appealing web applications. By gaining proficiency in React, React Router, Sass, and CSS animations, I am well-equipped to create sophisticated web applications that meet industry standards and user expectations."
      }
    },
    {
      "id": "24",
      "title": "Client Portfolio's SEO",
      "description": "In this project, I optimized a website's SEO, performance, and accessibility, using tools like Lighthouse and Wave. These enhancements are crucial for improving visibility, user experience, and client satisfaction",
      "tags": ["all", "frontend"],
      "imageNumber": 4,
      "repository": "https://github.com/Gilles-Lucien/ninacarducci---backup.git",
      "gitPages": "https://gilles-lucien.github.io/ninacarducci---backup/",
      "section1": {
        "title": "Concept",
        "subtitle": " and Learning Objectives",
        "description": "In this training project, I worked as a freelance developer to optimize a website's SEO, performance, and accessibility. My initial task was to identify loading and SEO issues, followed by proposing recommendations to enhance loading speed, code structure, and SEO. I then implemented the suggested improvements by modifying the site’s code. The goal was to enhance the site’s performance and accessibility, thus improving its search engine ranking. I utilized tools such as Lighthouse and Wave to conduct these optimizations. Finally, I created a report showcasing the results before and after the modifications. This report included screenshots from the audits and detailed explanations of the changes made and their impact on the site’s SEO and accessibility."
      },
      "section2": {
        "title": "Application",
        "subtitle": " and Career Relevance",
        "description": "Optimizing SEO and accessibility are critical skills in web development. These skills are essential for increasing a website’s visibility and accessibility, thereby boosting traffic and reach. The ability to analyze and improve a site's performance is highly sought after, as it directly contributes to user experience and client satisfaction. Mastering these competencies enhances my ability to deliver high-quality web solutions."
      }
    },
    {
      "id": "25",
      "title": "724events",
      "description": "In this project, I debugged and finalized a one-page website, utilizing tools like Chrome DevTools and React Developer Tools. This experience enhanced my debugging skills, test planning, and proficiency with tools like Yarn and Node.js.",
      "tags": ["all", "frontend"],
      "imageNumber": 4,
      "repository": "https://github.com/Gilles-Lucien/Debuggez-une-application-React.JS.git",
      "section1": {
        "title": "Concept",
        "subtitle": " and Learning Objectives",
        "description": "In this training project, I focused on debugging and finalizing the development of a one-page website. My first task was to review the existing code using Chrome DevTools to identify and understand the reported issues and bugs. After identifying the problems, I resolved them using my JavaScript skills and tools specific to React, such as React Developer Tools. Additionally, I was responsible for completing the test plan, detailing all the test scenarios necessary to verify the site's functionality, including unit and functional tests. I utilized Yarn as the package manager and Node.js to run server-side JavaScript code, managing dependencies and running local tests effectively. Throughout the project, I versioned my work with GitHub and used Visual Studio Code as my development and debugging environment."
      },
      "section2": {
        "title": "Application",
        "subtitle": " and Career Relevance",
        "description": "Debugging is a fundamental skill for any web developer, as it is crucial to identify and quickly resolve code issues. Writing a comprehensive test plan and conducting unit and functional tests are important practices to ensure the quality and reliability of a website. Mastering tools such as React Developer Tools, Yarn, and Node.js enriches my developer toolkit and prepares me to work on complex web projects. These skills are essential for maintaining high standards in web development and contributing to efficient, effective, and high-quality web solutions."
      }
    },
    {
      "id": "26",
      "title": "ArgentBank, Redux",
      "description": "In this project, I developed a banking application front-end using React and Redux, integrating it with the back-end via API calls. This experience enhanced my skills in creating dynamic user interfaces, managing global state, and documenting APIs.",
      "tags": ["all", "frontend"],
      "imageNumber": 5,
      "repository": "https://github.com/Gilles-Lucien/ArgentBank-website.git",
      "section1": {
        "title": "Concept",
        "subtitle": " and Learning Objectives",
        "description": "In this training project, I worked on the front-end development of a banking application using React and Redux to create a dynamic and responsive user experience. My main task was to integrate the front-end with the back-end through API calls. I wrote REST API calls to ensure seamless communication between the client and the server. I used React to develop the user interface of the banking application, focusing on creating a comprehensive and responsive dashboard for users. Redux was employed to manage the application’s data, maintaining a consistent global state throughout the application. Additionally, I used Swagger to define API endpoints and model data interactions, providing a clear description of the various routes and actions needed for the API. Node.js was utilized to run JavaScript code on the server side, offering hands-on experience with full-stack application management."
      },
      "section2": {
        "title": "Application",
        "subtitle": " and Career Relevance",
        "description": "Mastering React and Redux is crucial for any modern front-end developer, particularly for those working on complex web applications. These technologies enable the development of dynamic, efficient, and responsive user interfaces. Using Swagger to document APIs is also a valuable skill, ensuring clarity and maintainability of the programming interface. This project equipped me with practical experience in integrating front-end and back-end systems, managing global application state with Redux, and documenting APIs with Swagger."
      }
    },
    {
      "id": "27",
      "title": "This portfolio",
      "description": "In this project, I created and deployed my personal developer portfolio using Figma, React, SASS, Git, and GitHub. This experience enhanced my skills in responsive web design, project management, and online deployment",
      "tags": ["all", "frontend", "graphic", "uxui"],
      "imageNumber": 4,
      "repository": "https://github.com/Gilles-Lucien/portfolio.git",
      "figma": "https://www.figma.com/design/PtVepgfjlWL5bmIvVRcb90/Portfolio-p12",
      "section1": {
        "title": "Concept",
        "subtitle": " and Learning Objectives",
        "description": "In this project, I undertook the creation and online deployment of my personal developer portfolio, showcasing my journey, skills, and projects professionally. The first step involved designing a Figma mockup to plan the layout and structure of the site. Following the mockup, I developed the site from scratch using React for building dynamic components and SASS for styling, ensuring a modern and responsive design. Throughout the project, I used Git and GitHub for version control, managing the development process effectively. Ensuring the site displayed correctly across all devices was crucial, necessitating attention to responsive design principles for optimal user experience."
      },
      "section2": {
        "title": "Application",
        "subtitle": " and Career Relevance",
        "description": "Creating an online portfolio is key for any developer seeking to stand out and secure professional opportunities. The skills gained from this project, such as deploying a website online and ensuring it is responsive, are fundamental in web development. Mastering React and SASS for building and styling the site, along with using Git and GitHub for version control, demonstrates my ability to handle comprehensive web development tasks."
      }
    },
    {
      "id": "28",
      "title": "Boréo",
      "description": "In this project, I redesigned Boréo's home page for UX and UI improvements, focusing on user engagement and visual appeal.",
      "tags": ["all", "uxui"],
      "imageNumber": 6,
      "section1": {
        "title": "Visual Enhancement",
        "subtitle": " and Information Hierarchy",
        "description": "In the UX redesign of Boréo's homepage, my work primarily focused on enhancing the visual aspect of the site and creating a better information hierarchy. I ensured that the site's aesthetics were not only modern and appealing but also consistent with Boréo's brand identity. By redefining the layout of visual elements and optimizing the use of space, I made the interface more enjoyable and intuitive for users. The goal was to ensure that visitors could immediately understand Boréo's offerings and easily find the essential information at a glance."
      },
      "section2": {
        "title": "Simplifying the User Journey",
        "subtitle": " to Products",
        "description": "Another key aspect of my work was to shorten and simplify the user journey to the products. By analyzing user behavior and identifying friction points in their journey, I reorganized the elements on the homepage so that users could quickly access the products they are interested in. I also reduced the number of steps required to complete key actions, such as purchasing or searching for specific products. This simplification of the user journey aims to increase engagement and improve conversion rates while providing a smooth and satisfying experience on the Boréo platform."
      }
    }
  ]
}
